# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..Description Property
FabricationConfigurationInfo Class See Also
---
The description of the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string Description { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
}
```

# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace